package buu.informatics.s59160586.androidfinalproject


import android.os.Bundle
import android.os.Handler
import androidx.fragment.app.Fragment
import android.view.LayoutInflater
import android.view.View
import android.view.ViewGroup
import android.widget.Toast
import androidx.databinding.DataBindingUtil
import androidx.lifecycle.ViewModelProviders
import androidx.navigation.findNavController
import androidx.navigation.fragment.findNavController
import buu.informatics.s59160586.androidfinalproject.database.Animal
import buu.informatics.s59160586.androidfinalproject.databinding.FragmentAnimalAddBinding
import buu.informatics.s59160586.androidfinalproject.databinding.FragmentAnimalListBinding

/**
 * A simple [Fragment] subclass.
 */
class AnimalAdd : Fragment() {
    private lateinit var viewModel: ViewModel

    override fun onCreateView(
        inflater: LayoutInflater, container: ViewGroup?,
        savedInstanceState: Bundle?
    ): View? {
        // Inflate the layout for this fragment
        val binding = DataBindingUtil.inflate<FragmentAnimalAddBinding>(inflater,
            R.layout.fragment_animal_add,container,false)

        viewModel = ViewModelProviders.of(this).get(ViewModel::class.java)

        binding.animalImage.setImageResource(R.drawable.animalic)
        binding.acceptButton.setOnClickListener {
            addAnimal(binding)
        }
        return binding.root
    }

    private fun addAnimal(binding: FragmentAnimalAddBinding) {
        if (!binding.animalName.text.isNullOrEmpty() && !binding.animalEngName.text.isNullOrEmpty() && !binding.animalSciName.text.isNullOrEmpty()
            && !binding.animalSpeName.text.isNullOrEmpty() && !binding.animalFoodAndLocation.text.isNullOrEmpty()
            && !binding.animalDetail.text.isNullOrEmpty()) {
            if (binding.animalName.text.toString().equals("1") && binding.animalEngName.text.toString().equals("1")
                && binding.animalSciName.text.toString().equals("1") && binding.animalSpeName.text.toString().equals("1")
                && binding.animalFoodAndLocation.text.toString().equals("1") && binding.animalDetail.text.toString().equals("1")) {
                viewModel.insert(
                    Animal(
                        "วาฬเพชฌฆาต",
                        R.drawable.killerwhales,
                        "Killer whales",
                        "Orcinus orca",
                        "O. orca",
                        "    วาฬชนิดนี้กินสัตว์ทะเลอื่นๆ เป็นอาหาร รวมทั้งฉลาม โลมา แมวน้ำ สิงโตทะเล เพนกวิน หรือแม้แต่วาฬต่างสปีชีส์ที่มีขนาดใหญ่กว่า จึงได้ชื่อว่าเป็นวาฬชนิดที่ดุร้ายที่สุดในโลก ซึ่งเทคนิคการล่าเหยื่อของวาฬเพชฌฆาตมีหลายรูปแบบขึ้นอยู่กับชนิดของเหยื่อผู้โชคร้าย แต่โดยทั่วไปวาฬเพชฌฆาตในธรรมชาติจะไม่ทำร้ายมนุษย์\n" +
                                "    วาฬเพชฌฆาตอาศัยอยู่ในมหาสมุทรได้ทั่วโลก ตั้งแต่อาร์กติกเรื่อยไปจนถึงแอนตาร์กติก รวมทั้งในทะเลแถบเขตร้อน นักวิทยาศาสตร์จำแนกวาฬเพชฌฆาตออกเป็น 3 สายพันธุ์หลัก ได้แก่\n" +
                                "– สายพันธุ์ทั่วไป (Resident) ส่วนใหญ่อาศัยอยู่ตามชายฝั่งด้านตะวันออกเฉียงเหนือของมหาสมุทรแปซิฟิก อยู่รวมกันเป็นครอบครัวอย่างเหนียวแน่น\n" +
                                "\n" +
                                "– สายพันธุ์อพยพ (Transient) มักเดินทางไปทั่วตามชายฝั่งทะเล รวมกลุ่มกันเล็กๆ ราว 2-6 ตัว แต่ไม่เป็นครอบครัวเหนียวแน่นและมีพฤติกรรมไม่ซับซ้อนเท่าสายพันธุ์ทั่วไป\n" +
                                "\n" +
                                "– สายพันธุ์ทะเลลึก (Offshore) นักวิทยาศาสตร์เพิ่งค้นพบวาฬเพชฌฆาตสายพันธุ์นี้เมื่อปี 1988 ซึ่งมีพันธุกรรมแยกออกจาก 2 สายพันธุ์ข้างต้นอย่างชัดเจน ส่วนใหญ่อาศัยอยู่ในทะเลเปิด มักรวมตัวกันเป็นฝูงขนาดใหญ่ประมาณ 60 ตัว แต่พฤติกรรมอื่นๆยังมีข้อมูลน้อยมาก",
                        "    วาฬเพชฌฆาตมีสีดำบริเวณส่วนหลัง และมีส่วนอกและท้องเป็นสีขาว รวมทั้งบางส่วนของด้านข้างลำตัวและด้านหลังดวงตาที่มีสีขาวเช่นกัน ลำตัวขนาดใหญ่และแข็งแรงมาก มีครีบหลังขนาดใหญ่คล้ายรูปสามเหลี่ยมมสูงถึง 2 เมตร โดยทั่วไปวาฬเพชฌฆาตตัวผู้จะมีความยาว 6-8 เมตร และมีน้ำหนักประมาณ 6-7 ตัน ส่วนตัวเมียมีขนาดเล็กกว่าไม่มาก แต่วาฬเพชฌฆาตบางตัวอาจมีความยาวได้สูงสุดเกือบ 10 เมตร และหนักถึง 10 ตัน ซึ่งวาฬเพชฌฆาตสามารถว่ายน้ำได้เร็วกว่า 56 กิโลเมตรต่อชั่วโมง\n" +
                                "    วาฬเพชฌฆาตเป็นสัตว์สังคมที่มีพฤติกรรมซับซ้อน มีตัวเมียเป็นจ่าฝูง หากมีชีวิตอยู่ในธรรมชาติ วาฬเพชฌฆาตเพศเมียจะมีอายุยืนเฉลี่ย 50-60 ปี หรืออาจยืนยาวถึง 90 ปี ขณะที่วาฬเพชฌฆาตเพศผู้จะมีอายุเฉลี่ยที่ 29 ปี และอายุยืนสูงสุดได้ถึง 60 ปี แต่หากเป็นวาฬเพชฌฆาตที่ถูกเลี้ยงไว้ในสวนสัตว์น้ำ จะมีช่วงอายุสั้นกว่าพวกเดียวกันที่อยู่ในธรรมชาติอย่างมาก บางตัวอาจอยู่ได้ไม่เกิน 25 ปีก็มี วาฬเพชฌฆาตจัดเป็นนักล่าอันดับต้น ๆ มันกินอาหารราว 227 กิโลกรัม/วัน และมันไม่เคยนอนหลับ แต่จะใช้วิธีว่ายน้ำช้า ๆ แทน ไม่อย่างนั้นมันจะจมน้ำตาย วาฬเพชฌฆาตที่มีอายุมากกว่าจะสอนวิธีการล่าเหยื่อให้แก่วาฬเพฌฆาตที่อายุน้อยกว่า"
                    )
                )
            } else if (binding.animalName.text.toString().equals("2") && binding.animalEngName.text.toString().equals("2")
                && binding.animalSciName.text.toString().equals("2") && binding.animalSpeName.text.toString().equals("2")
                && binding.animalFoodAndLocation.text.toString().equals("2") && binding.animalDetail.text.toString().equals("2")) {
                viewModel.insert(
                    Animal(
                        "โลมา",
                        R.drawable.dolphin,
                        "Dolphin",
                        "-",
                        "-",
                        "    โลมา อาศัยอยู่กระจัดกระจายทั่วไปในมหาสมุทรโดยทั่วไป ชอบกิน ปลาเล็ก ปลาหมึก และสัตว์พวกกุ้ง เคย ปู เป็นต้น  เมื่อออกหาอาหาร จะใช้สัญญาณเอคโค และออกล่าเป็นกลุ่ม ถึงแม้ว่าจะเป็นสัตว์ที่รวมกลุ่ม แต่โลมาสีชมพูก็จะดุร้ายได้เหมือนกัน และจะต้องการแยกตัวเองออกไปพอสมควรจากตัวอื่นเมื่อต้องการหาอาหาร หรือต้องกินอาหาร",
                        "    ลักษณะของโลมาที่เป็นที่รู้จักกันดี คือ มีรูปร่างเพรียวยาวคล้ายตอร์ปิโดหรือกระสวย ส่วนใหญ่มีปลายปากยื่นแหลม แต่ก็มีบางชนิดที่มีส่วนหัวกลมมนคล้ายแตงโมหรือบาตรพระ มีหางแบนในแนวนอน ไม่ใช่แนวตั้งเหมือนปลา เพื่อช่วยในการพุ้ยน้ำในแนวขึ้น-ลง ไม่มีขนปกคลุมลำตัว ไม่มีเกล็ด รวมทั้งไม่มีเมือกด้วย\n" +
                                "\n" +
                                "    นอกจากนี้แล้วยังมีอวัยวะต่าง ๆ ทุกส่วนเหมือนกับสัตว์เลี้ยงลูกด้วยนมทั่วไป หากแต่ละส่วนของอวัยวะจะปรับเปลี่ยนต่างไปจากสัตว์เลี้ยงลูกด้วยนมทั่วไป ดังนี้ จมูกของโลมามีไว้เพื่อหายใจ แต่จมูกนั้นต่างไปจากจมูกของสัตว์อื่น ๆ เพราะตั้งอยู่กลางกระหม่อมเป็นรูกลม เพื่อให้สะดวกต่อการเชิดหัวขึ้นหายใจเหนือน้ำ จากจมูกมีท่อหายใจต่อลงมาถึงปอดในตัว จึงไม่จำเป็นต้องให้น้ำผ่านเหงือกเข้าไปในปอดเพื่อช่วยหายใจเหมือนปลาหรือสัตว์น้ำอย่างอื่น และจมูกของโลมาตรงส่วนนี้ไม่สามารถใช้ในการรับกลิ่นได้เหมือนกับสัตว์อื่นทั่วไป ซึ่งในบรรดาวาฬมีฟันทุกชนิดต่างก็เป็นเช่นนี้เหมือนกันหมด[4] หูของโลมานั้นเป็นเพียงแค่รูขนาดเล็กติดอยู่ด้านข้างของหัวเท่านั้น มีประสิทธิภาพสูงมาก สามารถรับคลื่นเสียงใต้น้ำได้อย่างยอดเยี่ยม เพราะโลมาเหมือนวาฬตรงที่เป็นสัตว์ที่ติดต่อสื่อสารกันด้วยคลื่นเสียงที่ปล่อยออกมา โดยเฉพาะกับภาษาที่โลมาสื่อสารกันด้วยเสียงที่มีคลื่นความถี่สูง โลมามีดวงตาไม่เล็กเหมือนอย่างวาฬ แววตาแจ่มใส เหมือนตาสัตว์เลี้ยงลูกด้วยนมประเภทอื่น มีเปลือกตาปิดได้ และในเวลากลางคืนตาก็จะเป็นประกาย คล้ายตาแมว ตาของโลมาไม่มีเมือกหุ้มเหมือนตาปลา และมองเห็นได้ไกลถึง 50 ฟุต เมื่ออยู่ในอากาศ สีผิวของโลมาแต่ละชนิดจะแตกต่างกัน ส่วนมากจะออกไปในโทนสีเทา ตั้งแต่เข้มเกือบดำ จนกระทั่งถึงเกือบขาว แต่โดยทั่วไปโลมาจะมีสีผิวแบบ 2 สีตัดกัน ด้านบน เป็นสีเทาเข้ม ด้านล่างเป็นสีเกือบขาว เพื่อพรางตัวในทะเล ไม่ให้ศัตรูเห็น เพราะเมื่อมองจากด้านบน สีเข้มจะกลืนกับสีน้ำทะเล และถ้ามองจากด้านล่างขึ้นไป สีขาวก็จะกลืนเข้ากับแสงแดดเหนือผิวน้ำ\n" +
                                "\n" +
                                "    โลมาถือเป็นสัตว์ที่ว่ายน้ำได้อย่างคล่องแคล่วรวดเร็ว มีอัตราความเร็วในการว่ายน้ำประมาณ 55-58 กิโลเมตร/ชั่วโมง"
                    )
                )
            } else if (binding.animalName.text.toString().equals("3") && binding.animalEngName.text.toString().equals("3")
                && binding.animalSciName.text.toString().equals("3") && binding.animalSpeName.text.toString().equals("3")
                && binding.animalFoodAndLocation.text.toString().equals("3") && binding.animalDetail.text.toString().equals("3")) {
                viewModel.insert(
                    Animal(
                        "ฉลามเสือ",
                        R.drawable.tshark,
                        "Tiger shark",
                        "Galeocerdo cuvier",
                        "G.  cuvier",
                        "    บ่อยครั้งที่สามารถพบปลาฉลามเสือใกล้กับชายหาดทั้งในเขตร้อนและกึ่งเขตร้อนทั่วโลก มีพฤติกรรมเร่ร่อนโดยใช้กระแสน้ำอุ่นนำทาง ชอบอยู่ใกล้กับเส้นศูนย์สูตรในช่วงฤดูหนาว มักอาศัยในน้ำลึกตามแนวปะการัง แต่ก็สามารถเคลื่อนไหวในร่องน้ำตื้นเพื่อไล่ตามเหยื่อได้ ในทางตะวันตกของมหาสมุทรแปซิฟิก ปลาฉลามเสือสามารถพบไกลถึงประเทศญี่ปุ่นในทางเหนือและประเทศนิวซีแลนด์ในทางใต้ นอกจากนี้ยังสามารถพบได้ในทะเลแคริบเบียน, แอฟริกา, ประเทศจีน, เขตบริหารพิเศษฮ่องกง, ประเทศอินเดีย, ประเทศออสเตรเลีย, และประเทศอินโดนีเซีย รวมถึงอ่าวเม็กซิโก, ชายหาดของอเมริกาเหนือ,และบางส่วนของอเมริกาใต้\n" +
                                "    ดยที่อาหารได้แก่ ปลาและสัตว์น้ำชนิดต่าง ๆ เช่น เต่าทะเล รวมทั้งสัตว์เลี้ยงลูกด้วยน้ำนมในทะเล เช่น แมวน้ำ หรือ สิงโตทะเล ด้วย",
                        "    มีรูปร่างอ้วนป้อม ปากกว้าง ปลายปากสั้นและทู่ ลำตัวเรียวไปทางปลายหาง คอดหางมีสันชัดเจน ครีบหางเรียวและมีปลายแหลม มีฟันใหญ่เป็นรูปสามเหลี่ยม มีขอบหยักเป็นจักคล้ายฟันเลื่อย พื้นลำตัวและครีบสีน้ำตาลหม่น มีลายพาดขวางตลอดข้างหลังและหางคล้ายลายของเสือโคร่ง จึงเป็นที่มาของชื่อเรียก ซึ่งลายนี้อาจแตกเป็นจุดกระจายอยู่ทั่วไปหรือจางหมดไปเมื่อโตขึ้น ท้องมีสีจาง\n" +
                                "\n" +
                                "ปลาฉลามเสือเมื่อโตเต็มที่มีขนาดประมาณ 5 เมตร แต่ตัวที่ใหญ่ที่สุดที่เคยพบคือ 7 เมตร น้ำหนักหนักที่สุดคือ 807.4 กิโลกรัม พบกระจายว่ายหากินอยู่ทั่วไปในน่านน้ำเขตอบอุ่นทั่วโลก มีพฤติกรรมชอบหากินตามแนวปะการังหรือบริเวณใกล้ชายฝั่ง หรือบริเวณปากแม่น้ำ โดยอาศัยตั้งแต่ระดับผิวน้ำจนถึงความลึก 140 เมตร ปกติมักอยู่ลำพังเพียงตัวเดียวและหากินในเวลากลางคืน ว่ายน้ำได้คล่องแคล่วว่องไวมาก มีอาณาเขตในการหากินกว้าง 100 ตารางกิโลเมตร\n" +
                                "    ปลาฉลามเสือ นับได้ว่าเป็นปลาฉลามอีกชนิดหนึ่งที่มีอันตรายต่อมนุษย์ เพราะมีนิสัยดุร้ายและมีพฤติกรรมการกินที่ไม่เลือก ในพื้นที่ทะเลของไทยนับได้ว่าเป็นปลาฉลามที่อาจทำร้ายมนุษย์หรือนักดำน้ำได้ร่วมกับ ปลาฉลามหัวบาตรและปลาฉลามครีบดำโดยสถานที่ ๆ มีรายงานปลาฉลามเสือทำร้ายนักดำน้ำหรือนักโต้คลื่นมากที่สุด คือ ฮาวาย เชื่อว่าเกิดจากเหตุที่เป็นสถานที่ท่องเที่ยว จึงทำให้ปลาฉลามเสือเห็นกระดานโต้คลื่นผิดไปเป็นแมวน้ำซึ่งเป็นอาหารประกอบกับการที่มีเต่าทะเลซึ่งเป็นอาหารอีกอย่างหนึ่งกระจายพันธุ์สูงด้วย\n" +
                                "    ปลาฉลามเสือ เป็นปลาที่ออกลูกเป็นตัว ในระยะเวลาตั้งท้องนานเกือบหนึ่งปี สามารถตกลูกได้ตลอดทั้งปี โดยเฉลี่ยจะตกลูกครั้งละ 10-82 ตัว ลูกปลาแรกเกิดมีความยาวประมาณ 51.76 เซนติเมตร เข้าสู่วัยเจริญพันธุ์เมื่ออายุได้ 4-6 ปี อายุขัยโดยเฉลี่ย 12 ปี แต่อายุในสถานที่เลี้ยงมักจะมีอายุเพียงสั้น ๆ ไม่เกิน 2 เดือนเท่านั้น"
                    )
                )
            } else if (binding.animalName.text.toString().equals("4") && binding.animalEngName.text.toString().equals("4")
                && binding.animalSciName.text.toString().equals("4") && binding.animalSpeName.text.toString().equals("4")
                && binding.animalFoodAndLocation.text.toString().equals("4") && binding.animalDetail.text.toString().equals("4")) {
                viewModel.insert(
                    Animal(
                        "ฉลามขาว",
                        R.drawable.wshark,
                        "Great white shark",
                        "Carcharodon carcharias",
                        "C.  carcharias",
                        "    ปลาฉลามขาวอาศัยอยู่ตามแถบทะเลชายฝั่งเกือบทั่วทุกมุมโลก ที่มีอุณหภูมิระหว่าง 12 – 24 องศาเซลเซียส แต่จะอาศัยอยู่หนาแน่นบริเวณอ่าวประเทศออสเตรเลีย ทางตอนใต้ของทวีปแอฟริกา แคลิฟอเนีย และตอนกลางของทะเลเมดิเตอร์เรเนียน แต่ที่หนึ่งที่หนาแน่นที่สุดอยู่ที่ ไดร์เออร์ ไอร์แลนด์ (Dyer Island, South Africa) ที่แอฟริกาใต้ ทั้งยังสามารพบได้ในเขตร้อนแถบทะเลเมดิเตอร์เรเนียน ปลาฉลามขาวเป็นปลาน้ำลึก แต่ที่บันทึกจำนวน ส่วนมากจะมาจากการสำรวจแถบทะเลชายฝั่ง บริเวณที่มีสิงโตทะเล แมวน้ำ โลมาอาศัยอยู่ ได้มีความพยายามที่จะสำรวจในบริเวณน้ำลึก ถึงระดับ 1280 เมตร ผลปรากฏว่าจะพบมากบริเวณผิวน้ำมากกว่า\n" +
                                "    โดยฉลามขาวมักจะโจมตีเหยื่อที่อยู่บริเวณผิวน้ำ และนี่เองเป็นสาเหตุที่ปลาฉลามขาวโจมตีมนุษย์ที่ว่ายน้ำอยู่ เนื่องจากการเคลื่อนไหวของมนุษย์บนผิวน้ำนั้น ทำให้พวกมันเข้าใจว่าเป็นสิงโตทะเลอาหารหลักของมัน ทุกครั้งที่ฉลามขาวกัดเหยื่อ มันจะปกป้องดวงตาของมันโดยการกลับลูกตาไว้ด้านใน ทำให้เห็นลูกตาเป็นสีดำ ฉลามขาวมีประสาทรับกลิ่นที่ไวมาก ทันทีที่ได้กลิ่นคาวเลือด พวกมันจะมา และโจมตีเหยื่อซึ่งไม่เว้นแม้กระทั่งพวกเดียวกันที่บาดเจ็บ",
                        "    ปลาฉลามขาว สืบทอดเผ่าพันธุ์มาจากปลากระดูกอ่อนยุคดึกดำบรรพ์ โดยมีบรรพบุรุษร่วมกับกับปลาฉนาก ปลาโรนัน และปลากระเบน ฉลามขาวยักษ์เมื่อโตเต็มที่อาจยาวอาจมีความยาวถึง 7 เมตร และหนักถึงสามตัน สีลำตัวด้านหลังออกเป็นสีเทา ส่วนหน้าท้องจะมีสีขาว บริเวณด้านข้างลำตัวใกล้ศีรษะ จะมีแผงเหงือกสำหรับใช้หายใจ ช่วงชีวิตของฉลามขาวจะมีฟันหลายชุด และเมื่อฟันซี่ใดซี่หนึ่งหัก รากฟันจะฝ่อไป และฟันซี่ใหม่จะงอกขึ้นในเวลาสองสัปดาห์ ทั้งนี้นับเป็นลักษณะเฉพาะสำหรับสัตว์นักล่าที่บางครั้ง อาจต้องล่าสัตว์ที่กระดองแข็งหนาจนทำให้ฟันเกิดความเสียหาย\n" +
                                "    ฉลามเป็นปลาที่มีการปฏิสนธิภายใน นั่นคือ ตัวผู้สอดใส่อวัยวะนำสเปิร์มข้างใดข้างหนึ่ง (clasper) เข้าไปช่องสืบพันธุ์ของตัวเมีย โดยเริ่มแรกพวกมันต้องยึดกันให้ติดก่อน\n" +
                                "    “ฉลามตัวผู้จะกัดครีบของตัวเมียเอาไว้ เพื่อให้มั่นใจว่า ในขณะผสมพันธุ์จะไม่หลุดออกจากกัน” เบร็นนันบอก ฉลามตัวเมียจะมีผิวหนังที่หนากว่าตัวผู้ ทำให้มันสามารถรับมือกับฟันอันแหลมคมของตัวผู้ได้\n" +
                                "    นอกจากนี้ ฉลามยังจำเป็นต้องเคลื่อนตัวตลอดเวลาเพื่อการหายใจ ดังนั้น ในขณะเข้าคู่กัน พวกมันจึงเลือกทำกิจกรรมในกระแสน้ำที่แรงพอจะไหลผ่านช่องเหงือก เพื่อป้องกันการขาดอากาศหายใจ"
                    )
                )
            } else if (binding.animalName.text.toString().equals("5") && binding.animalEngName.text.toString().equals("5")
                && binding.animalSciName.text.toString().equals("5") && binding.animalSpeName.text.toString().equals("5")
                && binding.animalFoodAndLocation.text.toString().equals("5") && binding.animalDetail.text.toString().equals("5")) {
                viewModel.insert(
                    Animal(
                        "ปลาสลิดหินเบงกอล",
                        R.drawable.slidbengaul,
                        "Bengal sergeant",
                        "Abudefduf bengalensis (Bloch, 1787)",
                        "-",
                        "    กินสาหร่ายตามพื้นเป็นหลัก รวมถึงกินสัตว์ขนาดเล็กเป็นอาหารด้วย เช่น หอยฝาเดียวหรือปูขนาดเล็ก\n" +
                                "    อาศัยในแนวปะการัง ตามชายฝั่งในมหาสมุทรเขตร้อนและเขตอบอุ่นตั้งแต่ทางตะวันออกของมหาสมุทรอินเดียถึงญี่ปุ่นและออสเตรเลีย",
                        "    ลาสลิดหินเบงกอล เป็นปลาทะเลอยู่ในวงศ์ปลาสลิดหิน (Pomacentridae) ชื่อของปลามาจากภาษาอาหรับ โดยคำว่า อาบู(Abu) แปลว่า พ่อ คำว่า เดฟ (def) แปลว่า ด้าน และมีพหูพจน์ในตอนท้ายคำว่า ดัฟ (duf) โดยแปลรวมๆว่า ปลาตัวเก่งที่มีด้านที่โดดเด่น ลักษณะปลามีรูปร่างคล้ายกับปลาสลิดหินบั้งเขียวเหลือง (Abudefduf vaigiensis) เพียงแต่มีแถบสีดำในแนวตั้งทั้งหมด 7 แถบ และสีสันคล้ำกว่า  ปลายหางมน มีขนาดโตเต็มที่ยาว 17 เซนติเมตร\n" +
                                "    ตัวเต็มวัยพบอยู่เดี่ยว หรือเป็นกลุ่มขนาดเล็ก มักพบอยู่รวมกลุ่มกับปลาชนิดอื่นในวงศ์เดียวกัน เป็นปลาที่คุ้นเคยและไม่กลัวมนุษย์ จึงมักเห็นเข้ามากินขนมปังที่นักท่องเที่ยวให้อาหารตามแหล่งท่องเที่ยวทั่วไป ซึ่งปลาชนิดนี้เป็นปลาที่มีพฤติกรรมสร้างอาณาเขตโดยเฉพาะในช่วงผสมพันธุ์ โดยจะวางไข่บนพื้นผิวปะการังที่ตายแล้ว และตัวผู้จะเป็นผู้ดูแลไข่จนกระทั่งฟัก\n" +
                                "    วางไข่บนพื้นผิวปะการังที่ตายแล้ว และตัวผู้จะเป็นผู้ดูแลไข่จนกระทั่งฟัก"
                    )
                )
            } else {
                viewModel.insert(
                    Animal(
                        binding.animalName.text.toString(),
                        R.drawable.animalic,
                        binding.animalEngName.text.toString(),
                        binding.animalSciName.text.toString(),
                        binding.animalSpeName.text.toString(),
                        binding.animalFoodAndLocation.text.toString(),
                        binding.animalDetail.text.toString()
                    )
                )
            }
            Toast.makeText(
                getActivity(), "Save complete",
                Toast.LENGTH_LONG
            ).show()
            Handler().postDelayed({
                findNavController().navigate(AnimalAddDirections.actionAnimalAddToAnimalList2())
            }, 400)
        } else {
            Toast.makeText(
                getActivity(), "Please fill all field",
                Toast.LENGTH_LONG
            ).show()
        }
    }

}
